<pad>	0
<go>	0
<eos>	0
<unk>	14384
<blank>	0
.	162723
tom	31927
a	29957
'	29589
i	27848
?	26053
the	21888
que	20891
to	20741
you	19527
de	17920
no	17913
el	17097
la	14142
¿	13098
me	11988
t	11950
,	11702
is	10988
en	9837
es	9760
he	9283
un	7824
it	7802
s	7282
that	7045
se	6975
mary	6856
in	6790
of	6350
esta	5596
por	5565
was	5562
do	5415
lo	5397
this	5065
my	5030
have	4985
una	4934
we	4615
for	4366
mi	4289
don	4259
what	4237
she	4004
los	3926
can	3848
con	3797
su	3786
are	3687
te	3503
your	3499
m	3455
le	3441
his	3389
be	3274
ella	3259
on	3219
want	3168
with	3159
para	3153
not	2930
las	2898
and	2859
like	2836
y	2835
know	2764
mas	2736
tu	2673
at	2598
has	2583
al	2557
there	2414
re	2306
como	2282
him	2228
yo	2185
they	2180
go	2173
ll	2079
eso	1983
este	1980
estoy	1968
her	1963
$	1912
how	1906
will	1868
time	1849
_num_	1838
did	1838
very	1832
muy	1827
tiene	1812
ve	1799
si	1798
as	1788
here	1783
all	1776
didn	1725
tengo	1692
about	1674
had	1673
think	1653
quiero	1633
!	1632
aqui	1613
estaba	1612
up	1596
del	1584
get	1558
hacer	1527
casa	1520
fue	1498
cuando	1494
out	1485
one	1469
when	1421
if	1409
puedo	1409
from	1388
an	1387
going	1368
son	1356
esto	1342
were	1342
why	1336
todo	1328
come	1302
who	1302
algo	1293
doesn	1250
good	1241
hay	1238
tiempo	1226
by	1213
gusta	1207
would	1198
solo	1196
see	1190
favor	1185
ha	1180
todos	1160
let	1150
please	1142
tan	1138
need	1099
nada	1097
estas	1092
boston	1091
been	1091
ir	1081
just	1080
era	1070
vez	1065
donde	1058
where	1054
so	1039
more	1037
puede	1037
bien	1036
quien	1034
mucho	1033
help	1029
tell	1020
now	1002
than	1000
never	977
but	967
got	960
nos	960
ya	952
should	944
manana	929
too	929
us	928
ser	925
¡	925
some	918
something	911
creo	901
nunca	898
much	887
ellos	886
take	877
d	862
could	861
ahora	859
trabajo	854
tienes	846
last	845
money	835
day	834
car	834
home	814
people	812
dijo	805
dinero	805
sus	794
work	788
tomas	788
isn	788
estan	780
soy	776
pero	773
dos	769
nadie	764
am	757
puedes	751
ese	746
said	738
really	734
our	732
back	725
siempre	724
hablar	723
hoy	716
any	714
quiere	713
habia	710
told	709
hace	706
dia	706
lot	703
house	700
anything	699
voy	697
esa	689
make	687
today	687
poco	686
eat	679
frances	678
mejor	671
verdad	671
eres	666
book	663
many	661
thought	661
say	659
french	659
libro	658
went	657
va	654
only	648
o	647
always	641
new	639
must	639
estar	631
sabe	630
ver	629
quieres	629
love	628
made	625
give	625
does	624
still	616
right	616
three	616
idea	616
long	615
school	612
two	607
mis	605
room	604
demasiado	596
tarde	596
hizo	591
antes	587
tenia	585
queria	584
usted	582
anos	581
parece	577
tres	576
maria	572
old	571
won	570
padre	566
tomorrow	564
every	563
talk	561
man	560
father	558
well	556
john	555
speak	551
left	551
off	551
wanted	550
night	548
noche	548
before	548
put	537
asked	533
little	525
better	525
sin	520
again	515
look	514
todavia	511
way	505
over	505
leave	504
yesterday	501
haber	499
hora	499
ayer	497
necesito	497
perro	497
sobre	496
dog	491
buy	490
comer	487
cuanto	485
or	485
everything	484
job	483
nothing	480
saw	478
hasta	477
them	476
stay	470
play	470
nuevo	469
happy	468
into	466
tenemos	465
after	465
gente	461
down	461
live	460
first	459
years	459
alguien	459
wants	454
decir	453
estado	451
dias	449
read	448
vida	447
mother	445
may	444
find	443
doing	443
children	440
coche	439
hombre	439
hecho	435
cual	431
came	431
hacerlo	430
asi	428
ti	428
took	427
sabia	426
life	426
nosotros	424
problema	423
mismo	423
stop	422
ask	421
other	418
these	417
estamos	416
gustaria	416
feel	408
understand	406
sure	402
madre	400
believe	397
next	396
keep	396
buen	395
deberias	394
couldn	394
problem	392
lost	392
try	391
deberia	389
pense	388
plan	388
call	388
friends	388
otra	386
bought	384
mundo	384
used	382
ever	381
semana	380
puerta	379
away	379
happened	378
morning	376
tus	376
vas	375
alli	375
seguro	372
uno	370
habitacion	370
ninos	366
cosas	366
despues	365
alguna	364
doctor	363
casi	363
late	362
everyone	361
escuela	359
their	357
fuera	356
soon	356
already	356
door	353
podria	352
name	352
sabes	352
gave	352
english	351
amigos	351
realmente	351
pasado	351
wasn	350
ni	349
wrong	348
remember	347
hard	346
feliz	345
australia	345
wait	340
ingles	340
saber	338
veces	338
les	336
enough	333
paso	333
year	332
water	332
friend	332
ayuda	332
dificil	329
buena	328
things	328
pronto	328
looking	327
busy	326
nuestro	325
sea	325
bad	324
agua	324
without	324
bus	324
muchos	323
married	323
done	322
knows	321
best	321
because	321
often	320
food	319
ahi	319
week	318
bed	318
hope	317
ano	317
use	316
menos	316
alone	316
found	313
otro	312
desde	312
visto	312
even	312
conmigo	310
nino	310
hear	309
likes	309
same	309
comida	308
looks	306
seen	306
heard	306
cold	305
aun	305
cafe	304
nombre	304
personas	303
amigo	301
drink	301
todas	301
dio	301
vino	299
auto	299
comprar	299
cada	298
able	298
haciendo	296
brother	296
boy	295
coffee	294
pregunto	294
ciudad	293
beautiful	292
espero	291
yet	291
being	288
fiesta	288
someone	288
gran	288
big	288
person	287
knew	287
mal	287
watch	284
teacher	282
party	281
wish	278
hermano	277
cama	277
open	277
toda	276
tanto	276
tired	276
tienen	276
answer	276
sleep	275
around	275
contigo	275
persona	272
vi	271
thing	271
bueno	270
days	270
libros	269
porque	269
world	268
nuestra	268
habla	268
learn	267
dejo	266
television	265
aren	265
haven	264
salir	264
tener	264
tren	264
profesor	263
train	262
clase	262
leer	260
durante	260
han	260
true	258
dice	257
which	257
vamos	256
mind	256
another	255
carta	255
books	255
happen	255
getting	254
lunes	254
study	254
those	254
tambien	252
tried	252
almost	252
pay	252
girl	252
care	251
turn	250
hospital	250
cuenta	250
seems	250
podia	250
ten	248
rapido	248
nobody	247
while	247
padres	246
met	246
letter	246
parents	246
hotel	245
siento	245
lugar	244
podemos	244
both	244
problemas	243
familia	243
gustan	242
once	242
together	242
anyone	241
kind	241
monday	240
tuvo	240
momento	239
talking	239
muchas	238
walk	238
policia	238
puso	238
telefono	237
few	236
died	236
cerca	235
young	235
grande	235
family	234
early	233
tv	233
mine	233
each	231
fui	230
acerca	230
vivir	229
place	229
looked	229
crees	229
sister	229
afraid	227
lunch	227
vive	227
hijo	226
horas	226
dinner	225
country	224
mujer	224
trabajar	223
wouldn	223
write	222
until	222
most	222
else	222
estaban	221
hermana	221
ustedes	221
tomar	221
sido	220
great	220
razon	220
easy	219
show	219
pudo	218
japon	218
mayor	218
own	218
estos	218
japan	218
venir	217
joven	217
cat	217
might	217
truth	217
meeting	216
sorry	215
murio	215
debes	215
anoche	215
angry	214
volver	214
rain	214
dije	214
diez	214
wife	213
acuerdo	213
hice	212
bastante	212
temprano	211
phone	211
coming	210
miedo	210
cosa	210
nueva	209
ayudar	209
child	209
difficult	209
everybody	209
facil	208
eating	208
ago	208
aprender	207
hurt	207
debe	206
table	206
hacia	204
ocupado	204
entre	204
piano	203
accidente	202
matter	202
yourself	202
jugar	202
mesa	201
parte	201
gracias	201
necesita	201
hate	201
menudo	201
favorite	201
gato	200
viene	200
question	200
playing	200
waiting	200
since	199
hours	199
dejar	198
ready	198
dicho	198
reading	198
nadar	197
pretty	197
ate	197
says	197
himself	197
far	196
mano	196
anymore	196
historia	196
shoes	195
minutes	195
dormir	195
llegar	195
shouldn	194
ultima	194
pidio	194
pasar	194
fun	192
trying	192
police	191
lives	191
nice	191
os	191
called	191
hand	190
llego	190
started	190
drive	189
mucha	189
mientras	187
estacion	187
alto	187
sick	187
tonight	186
camino	186
such	186
pregunta	186
ran	186
sera	185
frio	185
finished	185
accident	185
minutos	185
five	184
important	184
hijos	184
estudiar	184
musica	184
myself	183
meet	182
usually	182
algun	182
conozco	182
algunas	180
needs	180
deja	180
encontrar	179
office	179
story	179
zapatos	179
cinco	179
bebe	179
decision	179
felt	178
cansado	178
trouble	178
decided	178
pueden	178
vio	177
working	177
music	177
tipo	177
swim	177
algunos	176
estuvo	176
unos	176
change	176
times	176
error	175
pais	175
pelicula	175
under	175
having	174
podrias	173
station	173
somos	173
woman	173
juntos	173
compro	172
bajo	172
hemos	172
park	172
importante	172
city	171
suficiente	171
red	170
arrived	170
fire	170
month	170
ventana	169
start	169
milk	169
hot	168
small	168
lado	168
students	167
colegio	167
sola	167
hablando	167
run	166
pienso	166
primera	166
esperar	165
movie	165
forget	164
rio	164
importa	164
longer	163
punto	163
stupid	163
hair	163
tennis	163
debo	163
compre	163
eyes	163
opinion	163
christmas	163
ojos	163
mistake	163
homework	162
window	162
fuerte	161
goes	161
fast	161
reunion	160
buscando	160
radio	159
esperando	159
breakfast	159
tal	159
mes	158
edad	158
tuve	158
thank	158
da	158
oficina	158
comes	158
unico	157
town	157
dar	157
baby	157
interesting	157
necesitas	157
pelo	156
veo	156
queda	156
broke	155
ido	155
cabeza	155
pasa	154
quedo	153
fin	153
contra	153
picture	153
gone	152
bicicleta	152
caso	152
fueron	151
leche	151
word	151
game	151
verano	150
language	150
lleva	150
conducir	150
ningun	149
close	149
solia	149
estudiantes	149
america	148
verte	148
then	148
advice	148
duro	148
smoking	148
along	148
quisiera	148
song	147
summer	147
cake	147
ganas	146
misma	146
finish	146
spend	146
fumar	145
media	145
taking	145
chance	145
quite	145
face	145
fish	145
full	145
makes	145
bit	144
watching	144
against	144
rich	144
medico	144
afternoon	144
viejo	144
cancion	144
llave	143
tenis	143
fell	143
unas	143
llegue	143
listen	143
entrar	143
cara	143
perder	143
hour	142
trust	142
reloj	142
making	142
japanese	142
chico	141
cree	141
older	141
cuarto	141
ropa	141
seis	141
dolor	141
later	141
cualquier	141
cuantos	141
pase	140
clock	140
free	140
esposa	140
haga	140
regalo	139
forgot	139
china	139
acabo	139
men	139
seria	138
through	138
vaya	138
interesante	138
bring	138
creer	138
autobus	138
caught	138
perdido	138
sueno	138
class	138
preguntas	137
capaz	137
manera	137
pie	137
loves	137
seem	137
ninguna	136
end	136
weather	136
tree	135
short	135
visit	135
escribir	135
computer	135
calle	134
six	134
taxi	134
caja	134
hiciste	134
clean	134
studying	134
war	134
avion	133
quieren	133
dream	133
unidos	133
born	133
living	133
mio	132
salio	132
odio	132
respuesta	132
navidad	132
dolares	132
turned	132
dark	132
estados	132
oido	132
tomo	132
usar	131
juego	131
chica	131
cierto	131
stopped	131
thinking	131
number	131
real	131
careful	130
thinks	130
hija	130
extranjero	130
sometimes	130
tocar	130
lejos	130
guerra	130
cumpleanos	130
street	129
lived	129
iba	129
hubiera	129
student	128
palabra	128
hombres	128
company	128
hasn	128
river	127
perdio	127
tienda	127
box	127
surprised	127
listo	127
falta	127
dead	127
camara	127
sat	127
hablo	126
terminar	126
manos	126
llevo	126
wonder	126
queremos	126
hare	126
parecia	126
daughter	126
pude	125
light	125
hungry	125
malo	125
death	125
pueda	125
sit	125
vos	124
numero	124
queres	124
large	124
mean	123
high	123
muerte	123
cuidado	123
killed	123
ojala	123
suerte	123
snow	123
stand	123
hagas	123
estabas	123
encontre	123
necesitamos	123
cut	123
near	122
otros	122
hands	122
birthday	122
parque	122
kept	121
present	121
deberiamos	121
oir	121
questions	121
encanta	121
van	120
camera	120
white	120
pequeno	120
forma	120
news	120
palabras	120
jamas	119
pensar	119
began	119
rest	119
moment	119
llamo	119
viaje	119
anybody	119
miss	119
hurry	119
win	119
examen	119
behind	118
tenido	118
wine	118
possible	118
alla	118
vivo	118
spent	118
libre	118
esperaba	118
aquel	118
hit	118
dejame	118
calor	117
beber	117
perros	117
sol	117
dogs	117
quieras	117
ven	117
wrote	117
esos	117
di	116
vuelta	116
cena	116
luz	116
bicycle	116
age	116
vacaciones	116
rico	116
became	116
works	116
gets	116
posible	115
novia	115
clothes	115
banco	115
siquiera	115
recuerdo	115
trabaja	115
hambre	115
its	115
die	115
espera	114
reason	114
between	114
kill	114
llama	114
entender	113
lista	113
different	113
dame	113
realidad	113
tea	113
entiendo	113
part	113
piensa	113
pagar	113
rather	113
aca	113
lie	112
whether	112
futbol	112
store	112
arbol	112
primero	112
flowers	112
sing	112
ice	112
final	112
outside	112
culpa	111
ruido	111
eaten	111
crazy	111
maybe	111
secret	111
poder	111
key	111
tio	111
paid	111
canadian	110
hold	110
haya	110
strange	110
extrano	110
pensando	110
cannot	109
enfermo	109
pensaba	109
foto	109
glad	109
secreto	109
proximo	109
oportunidad	109
cerveza	109
team	109
carne	109
bag	108
vestido	108
terminado	108
sos	108
yours	108
sunday	108
empezo	108
wearing	108
diccionario	108
terrible	108
nina	108
vale	107
estare	107
consejo	107
paris	107
piensas	106
golf	106
changed	106
nieve	106
canadiense	106
largo	106
lose	106
decidio	106
expensive	105
cocina	105
girlfriend	105
words	105
vista	105
entonces	105
four	105
worry	105
plane	105
sigue	105
equivocado	104
building	104
flores	104
pain	104
color	104
abroad	104
lengua	104
justo	104
dress	104
equipo	104
amor	104
debemos	104
others	104
lucky	104
women	104
glasses	104
takes	104
dollars	103
saying	103
stayed	103
thirty	103
front	103
during	102
beer	102
quede	102
problems	102
somebody	102
drunk	102
conoce	102
needed	102
worked	101
become	101
volvio	101
cats	101
llover	101
eran	101
business	101
cuantas	101
tarea	101
estudiante	101
dormido	101
ok	101
heart	101
puesto	100
quit	100
raining	100
proud	100
helped	100
thanks	100
husband	100
asleep	100
touch	99
compania	99
dijiste	99
estara	99
explain	99
tenes	99
treinta	99
noise	99
interested	99
ocurrio	99
gatos	99
bank	98
head	98
atencion	98
quickly	98
library	98
cuatro	98
black	98
biblioteca	97
feeling	97
llorar	97
cup	97
popular	97
bano	97
shirt	97
mujeres	97
trip	96
dangerous	96
movies	96
dime	96
smoke	96
mira	96
dentro	96
sentido	96
famous	96
safe	96
wear	95
ganar	95
cook	95
baseball	95
exactly	95
cenar	95
primer	95
asunto	95
side	95
catch	95
hat	95
cantar	95
played	95
esas	95
running	95
case	95
apenas	94
telephone	94
either	94
exactamente	94
exito	94
sad	94
whole	94
sitio	94
missed	94
nuestros	94
encontro	94
cry	94
break	94
speaking	93
cambiar	93
vendra	93
order	93
sombrero	93
divertido	93
trato	93
siete	93
uncle	93
errores	93
paper	93
haria	92
lleno	92
ello	92
opened	92
least	92
floor	92
fuego	92
probably	92
estuve	92
cost	92
conoces	92
peligro	92
estais	92
toma	92
mistakes	92
restaurant	92
rules	91
garden	91
broken	91
herself	91
enjoy	91
dance	91
barco	91
unica	91
peor	91
termino	91
hide	91
restaurante	91
weight	91
playa	91
par	91
acaso	91
vosotros	91
comio	90
lying	90
pena	90
advised	90
animals	90
alive	90
loved	90
edificio	90
tall	90
sound	90
tokyo	90
taza	90
ship	90
lluvia	90
caminar	89
air	89
seemed	89
dictionary	89
club	89
walked	89
aire	89
guitarra	89
haces	89
health	89
cayo	88
driving	88
huevos	88
situation	88
sun	88
glass	88
direccion	88
aconsejo	88
guess	88
venga	88
perdi	88
irse	88
cambio	88
viven	88
fotos	88
speaks	88
apple	87
whose	87
worried	87
inteligente	87
alrededor	87
waited	87
prefiero	87
animales	87
intento	87
known	87
younger	87
agree	87
loco	87
pedi	87
estupido	87
monton	87
strong	86
sleeping	86
probablemente	86
mala	86
triste	86
entro	86
seven	86
york	86
crying	86
kids	86
beisbol	85
sale	85
rompio	85
learned	85
jugando	85
gusto	85
salud	85
pass	85
solve	85
move	85
saben	85
muerto	85
talked	85
chocolate	85
miro	85
pasando	85
ayudarte	85
guitar	84
trabajando	84
pan	84
visitar	84
situacion	84
happens	84
jardin	84
fishing	84
blanco	84
blame	84
decirle	84
suelo	84
pequena	84
send	84
traffic	83
acaba	83
shopping	83
tokio	83
arrive	83
swimming	83
attention	83
desk	83
leaving	83
deberes	83
camisa	83
estudiando	83
choice	83
promised	83
irme	83
invited	83
leyendo	82
paraguas	82
poor	82
mia	82
digas	82
frente	82
llevar	82
proxima	82
ideas	82
llamar	82
habria	82
japones	82
drinking	82
vacation	82
meat	82
several	82
guys	81
serious	81
control	81
return	81
capital	81
almuerzo	81
suficientemente	81
winter	81
seeing	81
siendo	81
ultimo	81
blue	81
completely	81
lamento	81
minute	81
knife	81
deje	81
teach	81
brought	81
finally	81
pasada	80
favorito	80
umbrella	80
ambos	80
normal	80
point	80
boys	80
escuchar	80
wall	80
clases	80
evening	80
boca	80
sense	80
drank	80
sento	80
universidad	80
cancer	80
also	80
singing	79
weekend	79
set	79
imposible	79
seat	79
test	79
invierno	79
voz	79
ellas	79
eggs	79
beach	79
concierto	79
confiar	79
fine	79
prefer	78
ire	78
duele	78
simple	78
conseguir	78
partido	78
sal	78
afuera	78
travel	78
closed	78
tie	78
pen	78
peso	78
hermosa	78
road	78
llaves	78
desearia	78
papa	77
montana	77
worth	77
cuchillo	77
desayuno	77
taken	77
abuelo	77
abogado	77
intentando	77
adonde	77
expected	77
negro	77
weren	77
mama	77
estabamos	77
responder	77
concert	77
vayas	77
finalmente	77
peligroso	77
completamente	76
empezar	76
hubo	76
oi	76
cuesta	76
second	76
viajar	76
expect	76
sent	76
forward	76
waste	76
shut	76
sitting	76
resolver	76
showed	76
lawyer	76
chicos	76
marido	76
pictures	75
llevaba	75
grandfather	75
jefe	75
deal	75
piso	75
corazon	75
corto	75
mirando	75
papel	75
dejes	75
pareces	75
twice	75
domingo	75
funciona	75
future	75
lago	75
soccer	75
olvido	74
girls	74
wash	74
eats	74
alta	74
comiendo	74
caliente	74
message	74
viste	74
cream	74
correr	74
arm	74
promise	74
patient	74
ayudo	73
ability	73
dile	73
buenos	73
haz	73
morir	73
pizza	73
law	73
estudio	73
ticket	73
seas	73
helado	73
excuse	73
writing	73
mayoria	73
prueba	73
clear	73
united	73
detras	73
hiding	72
grandes	72
manzana	72
keys	72
venido	72
success	72
mad	72
mensaje	72
necesario	72
noticias	72
contento	72
rato	72
toca	72
mountain	72
driver	71
kiss	71
listening	71
accept	71
address	71
inside	71
machine	71
supongo	71
quedarme	71
sell	71
bath	71
abrigo	71
felices	71
atras	71
less	71
follow	71
significa	70
bailar	70
comido	70
slowly	70
rojo	70
sky	70
sounds	70
abierta	70
saco	70
aquella	70
estes	70
ves	70
cine	70
abrio	70
difference	70
guy	70
lake	70
though	70
decide	70
mil	70
smart	70
diciendo	70
telling	70
quiera	70
abandoned	70
quedarse	69
penso	69
actually	69
boss	69
clima	69
cooking	69
experience	69
medicine	69
podes	69
past	69
poner	69
perfect	69
olvide	69
liked	69
dientes	69
amable	69
llueve	69
aunque	69
half	69
escritorio	69
respecto	69
seguir	69
hermanos	69
simplemente	69
meses	69
hiciera	69
surprise	68
cielo	68
corriendo	68
escribio	68
pudiera	68
manzanas	68
ninguno	68
apples	68
wake	68
reglas	68
caro	68
save	68
pescado	68
amo	68
medio	68
scared	68
sofa	68
ayude	68
minuto	67
smile	67
pick	67
azucar	67
trata	67
means	67
taught	67
aeropuerto	67
nacio	67
estuviera	67
segura	67
causa	67
vaso	67
blood	67
walking	67
ocupada	67
necessary	67
vuelve	67
piece	67
horse	67
ocho	67
spoke	66
sign	66
happening	66
hago	66
foot	66
brazo	66
eye	66
fault	66
llegado	66
learning	66
languages	66
months	66
coat	66
taller	66
danger	66
kitchen	66
written	66
empieza	66
states	66
funny	66
domingos	65
casado	65
pieza	65
comenzo	65
hable	65
planes	65
serio	65
animal	65
normalmente	65
podeis	65
sala	65
hicieron	65
tenga	65
dejado	65
prisa	65
futuro	65
cocinar	65
verdaderamente	64
salt	64
sentia	64
staying	64
boyfriend	64
larga	64
tierra	64
impossible	64
figure	64
preocupado	64
fight	64
dano	64
humor	64
propio	64
honest	64
enemy	64
escucho	64
decirme	64
iglesia	64
worse	64
quiet	64
mouth	64
hardly	64
voice	64
plays	64
viendo	63
teneis	63
plans	63
sopa	63
dicen	63
comprado	63
bird	63
begin	63
rains	63
church	63
correcto	63
traje	63
shop	63
carro	63
bread	63
fruit	63
marry	63
sino	63
encontrado	63
stolen	63
semanas	63
senti	63
standing	63
e	63
comun	63
torta	63
buenas	63
conto	63
gano	63
ama	63
college	63
given	63
dios	62
offer	62
incluso	62
amiga	62
novio	62
nervous	62
usa	62
check	62
siguiente	62
canada	62
passed	62
american	62
derecho	62
siguio	62
idioma	62
evitar	62
gun	62
teeth	62
tengas	61
demas	61
novela	61
periodico	61
soup	61
beso	61
enamorado	61
pueblo	61
yes	61
storm	61
echo	61
sintio	61
pescar	61
verme	61
price	61
absent	61
date	61
recordar	61
till	61
lend	61
airport	61
diferencia	61
gas	61
laughed	61
entiende	61
pesar	61
feelings	61
diga	61
tome	61
hundred	61
temo	60
paciente	60
silla	60
verlo	60
habra	60
neither	60
noticia	60
brothers	60
heavy	60
precio	60
luna	60
failed	60
lloviendo	60
abuela	60
wallet	60
deseo	60
paseo	60
sabemos	60
leido	60
visited	60
alegro	60
estaria	60
ayudarme	60
pared	60
cierra	60
orgulloso	59
levanto	59
claro	59
tras	59
abrir	59
quedar	59
borrow	59
tormenta	59
jackson	59
ball	59
llame	59
mom	59
president	59
suena	59
suddenly	59
necesitaba	59
pedir	59
twenty	59
empty	59
menu	59
whatever	59
mar	59
exam	59
hablas	59
feed	59
hara	58
foreign	58
comi	58
choose	58
fly	58
aware	58
empleo	58
inmediatamente	58
olvides	58
matar	58
doubt	58
sentado	58
ride	58
corbata	58
moved	58
escrito	58
pobre	58
list	58
earth	58
zoo	58
mantener	58
smiled	58
gafas	58
fuimos	58
correct	58
anciano	58
refused	57
share	57
easily	57
lied	57
eight	57
prison	57
enfadado	57
sugar	57
smell	57
quiza	57
ill	57
contacto	57
comfortable	57
cartas	57
puente	57
couple	57
anywhere	57
tuyo	57
green	57
varias	57
cars	57
dijeron	57
count	57
intencion	57
talks	57
yen	56
raro	56
sentence	56
caballo	56
enojado	56
gana	56
asiento	56
leaves	56
newspaper	56
join	56
received	56
across	56
presidente	56
india	56
policeman	56
vuelto	56
fat	56
haberte	56
quise	56
famoso	56
native	56
escribe	56
totalmente	56
carefully	56
publico	56
project	56
experiencia	56
apologize	56
enfermedad	55
bonita	55
cita	55
robo	55
haberlo	55
chair	55
certain	55
enjoyed	55
grew	55
somewhere	55
ley	55
salvo	55
fear	55
siente	55
decirte	55
birds	55
medicina	55
veia	55
compras	55
bridge	55
tampoco	55
deberian	55
pocos	55
igual	55
nego	55
matematicas	54
volvere	54
tuvimos	54
novel	54
lentes	54
likely	54
habeis	54
mejores	54
bottle	54
eras	54
bolsa	54
volvera	54
blind	54
durmiendo	54
ought	54
paz	54
warm	54
almorzar	54
owe	54
carrera	53
shower	53
enseno	53
puedas	53
quito	53
succeed	53
beat	53
beginning	53
kid	53
guapa	53
azul	53
tratando	53
regret	53
area	53
raise	53
limpiar	53
otras	53
agradable	53
cambiado	53
contar	53
borracho	53
recuerda	53
supposed	53
entered	53
bill	53
parar	53
odia	53
dad	53
public	52
resfriado	52
decidido	52
hacerte	52
pocas	52
weeks	52
hates	52
stood	52
forgive	52
ordenador	52
carry	52
proyecto	52
joke	52
hayas	52
parado	52
gift	52
charge	52
silencio	52
wonderful	52
tarta	52
shot	52
thousand	52
god	52
sois	52
sangre	52
planning	52
nervioso	52
deep	52
gustaba	51
quedarte	51
dado	51
favorita	51
grandmother	51
querias	51
line	51
asking	51
rice	51
sentimientos	51
probable	51
common	51
olvidado	51
boton	51
peliculas	51
adelante	51
picnic	51
perfecto	51
repente	51
trees	51
oferta	51
kissed	51
bosque	51
cansada	51
suele	51
button	51
arroz	51
boligrafo	51
profundamente	51
faster	51
hacen	50
llega	50
correo	50
culpable	50
noticed	50
conoci	50
immediately	50
laugh	50
sono	50
cheese	50
information	50
fired	50
coger	50
fact	50
esperanza	50
murder	50
propia	50
prometio	50
escape	50
despacio	50
rang	50
encima	50
player	50
abajo	50
querria	50
delicious	50
wondered	50
hadn	50
sepa	50
report	50
costo	50
imagine	49
allowed	49
london	49
espere	49
painting	49
covered	49
creia	49
feels	49
bear	49
moon	49
juega	49
cards	49
guilty	49
finger	49
quereis	49
verde	49
welcome	49
vimos	49
stuck	49
vuestro	49
none	49
history	49
pajaro	49
sports	49
queso	49
frecuencia	49
worst	49
chicas	49
quiso	49
sientes	49
position	49
enemigo	49
llegara	49
veinte	48
acostumbrado	48
unfortunately	48
parecen	48
cargo	48
cualquiera	48
luck	48
single	48
fed	48
leg	48
izquierda	48
built	48
digo	48
paro	48
darme	48
believes	48
mintiendo	48
studied	48
fix	48
tears	48
village	48
watched	48
luego	48
escucha	48
tonto	48
arma	48
francia	48
jovenes	48
corrio	48
explained	48
harder	48
yourselves	47
tomado	47
except	47
pies	47
vuelva	47
ojo	47
arreglar	47
menor	47
intentar	47
primavera	47
wears	47
chinese	47
vegetables	47
rock	47
returned	47
ayudara	47
france	47
dices	47
perdida	47
middle	47
europe	47
convince	47
government	47
llorando	47
sorprendido	47
fruta	47
apartment	47
dare	47
washing	47
fuiste	47
dan	47
horrible	47
viviendo	47
nuestras	47
drinks	47
interesa	47
slept	47
discurso	47
rapidamente	47
caminando	47
king	47
rey	47
botella	47
ladron	47
encuentro	47
funeral	46
arboles	46
despierto	46
agreed	46
vayamos	46
hid	46
missing	46
grupo	46
prestado	46
judge	46
purpose	46
complaining	46
cookies	46
luces	46
sandwich	46
respect	46
tele	46
camion	46
juice	46
boring	46
herido	46
explanation	46
spoken	46
top	46
grow	46
pretended	46
realize	46
fall	46
peace	46
vere	46
permiso	46
suit	46
llena	46
oro	46
informacion	45
arrested	45
aceptar	45
resto	45
campo	45
bored	45
lee	45
pencil	45
saturday	45
satisfied	45
duty	45
tema	45
mexico	45
hagamos	45
paint	45
consider	45
understood	45
debajo	45
pasara	45
discuss	45
bike	45
belongs	45
innocent	45
segundo	45
yellow	45
mitad	45
ocupados	45
inocente	45
ahead	45
londres	45
hielo	45
sucedio	45
aburrido	45
platos	45
vieja	45
util	45
spring	45
ring	45
breath	45
threw	45
pastel	45
nueve	44
europa	44
internet	44
recently	44
special	44
mostro	44
windows	44
sorprendio	44
darle	44
sisters	44
hey	44
diferente	44
video	44
miles	44
hablan	44
seguridad	44
forever	44
principio	44
varios	44
support	44
espalda	44
ultimamente	44
earlier	44
pelota	44
whenever	44
actor	44
woke	44
quedate	44
irte	44
linea	44
sight	44
hicimos	44
painted	44
vuestra	44
llamada	44
abre	44
roto	44
ventanas	44
ended	43
profesora	43
dudo	43
memoria	43
rained	43
intente	43
preguntaba	43
solucion	43
keeps	43
oyo	43
junto	43
pone	43
jealous	43
hables	43
dressed	43
held	43
capacidad	43
crimen	43
oscuro	43
sorpresa	43
necesitan	43
nine	43
dropped	43
andar	43
truck	43
derecha	43
violin	43
nuevos	43
anda	43
promesa	43
usual	43
alcohol	43
shall	43
esposo	43
pertenece	43
courage	43
consiguio	43
tuya	43
conocen	43
lapiz	42
power	42
crowd	42
museum	42
mood	42
dedo	42
ordered	42
galletas	42
mato	42
invite	42
centro	42
hang	42
quizas	42
premio	42
casarse	42
aprendi	42
paciencia	42
opcion	42
pierna	42
involved	42
october	42
uso	42
calm	42
disappointed	42
clearly	42
attend	42
theater	42
handed	42
football	42
university	42
conocido	42
familiar	42
roja	42
jacket	42
locked	42
idiota	42
isla	42
computador	41
precios	41
pago	41
rara	41
passport	41
escribiendo	41
huele	41
behavior	41
trafico	41
course	41
continue	41
incendio	41
picked	41
rule	41
chicken	41
helping	41
wore	41
excepto	41
giving	41
heat	41
encuentra	41
cash	41
group	41
cause	41
tuviera	41
web	41
vosotras	41
prision	41
acabado	41
trampa	41
verdadero	41
feet	41
pasaporte	41
harvard	41
absence	41
liar	41
desayunar	41
duda	41
general	41
cerrar	41
perdon	41
vivia	41
octubre	41
noches	41
regreso	41
crime	41
chaqueta	40
moving	40
supermarket	40
bigger	40
hermanas	40
assume	40
muchacho	40
preparado	40
type	40
body	40
fence	40
descanso	40
recuerdas	40
assumed	40
estaras	40
fighting	40
boda	40
awake	40
llamare	40
corta	40
propuesta	40
especial	40
sooner	40
bromeando	40
mente	40
listened	40
buscar	40
multitud	40
peces	40
vete	40
bother	40
merece	40
cuerda	40
bedroom	40
mananas	40
quienes	40
interesado	40
compraste	40
pintura	40
classroom	40
escuche	40
chicago	40
dire	40
tendre	40
shy	40
speech	40
wedding	40
tastes	40
pair	40
conocia	40
casas	40
mail	40
injured	40
prepared	40
hazlo	39
yenes	39
map	39
flauta	39
ashamed	39
negocio	39
cola	39
maquina	39
healthy	39
recibi	39
absoluto	39
viento	39
calls	39
haberme	39
vote	39
admit	39
socks	39
gold	39
mentira	39
ante	39
spain	39
estudia	39
ducha	39
mapa	39
fill	39
gobierno	39
race	39
rent	39
reached	39
cool	39
frase	39
seldom	39
amaba	39
cien	39
golpeo	39
museo	39
calling	39
baja	39
appreciate	39
escaleras	39
cuerpo	38
depende	38
limpio	38
nearly	38
notice	38
dirty	38
dishes	38
nativo	38
grito	38
abandono	38
legs	38
podra	38
fixed	38
refrigerator	38
believed	38
stole	38
cerrada	38
explicar	38
prices	38
preocupes	38
cuidar	38
solution	38
alegra	38
flower	38
lock	38
useful	38
das	38
eventually	38
explicacion	38
vuelo	38
explico	38
thief	38
island	38
techo	38
osaka	38
roof	38
espana	38
view	38
wet	38
furniture	38
throw	38
tiro	38
cruel	38
discutir	38
billetera	38
german	38
intenta	38
bolsillo	38
preferiria	38
extremely	38
film	38
lonely	38
headache	38
personal	38
sonrisa	38
nor	37
disculpe	37
tia	37
arte	37
suitcase	37
japonesa	37
doce	37
flight	37
pintar	37
tenias	37
sweater	37
fresh	37
llamado	37
disparo	37
answered	37
intelligent	37
similar	37
ira	37
ajedrez	37
considered	37
inmediato	37
honesto	37
enferma	37
potatoes	37
piedra	37
jokes	37
sonrio	37
among	37
debido	37
bell	37
convinced	37
dreams	37
arriba	37
soldiers	37
apoyo	37
smells	37
uses	37
idiomas	37
consciente	37
quedara	37
modo	37
diario	37
dancing	37
wind	37
enter	37
jugo	37
stuff	37
casar	37
discusion	37
valor	37
expecting	36
ejercicio	36
respeto	36
supiera	36
escuchando	36
pez	36
absolutely	36
natural	36
dedos	36
solos	36
basura	36
agrada	36
fit	36
deaf	36
fabrica	36
escapar	36
deben	36
lights	36
bolso	36
harto	36
card	36
medianoche	36
boat	36
encontramos	36
levante	36
viernes	36
vienes	36
alarm	36
bella	36
resulto	36
oil	36
lavar	36
distancia	36
cogio	36
allow	36
realized	36
cabo	36
proposito	36
darte	36
midnight	36
murieron	36
cuales	36
soportar	36
oh	36
employees	36
comen	36
satisfecho	36
attack	36
laughing	36
butter	35
segun	35
correcta	35
accepted	35
mountains	35
canto	35
fond	35
averiguar	35
forgotten	35
partes	35
maleta	35
nosotras	35
descansar	35
madera	35
sonar	35
pajaros	35
raised	35
quedare	35
vuelvas	35
parada	35
post	35
drugs	35
filled	35
flute	35
followed	35
cantante	35
educacion	35
broma	35
verduras	35
confused	35
ponte	35
saved	35
mando	35
nurse	35
brush	35
teaching	35
step	35
whoever	35
washed	35
blanca	35
avoid	35
continued	35
hojas	35
nariz	35
human	35
dejara	35
negocios	35
noon	35
retraso	35
tenian	35
trae	35
sentir	35
low	35
burned	35
paises	35
deporte	35
sabado	35
carcel	35
vivido	35
facilidad	35
sacar	35
accused	35
duerme	35
sabias	35
lots	35
lleve	35
cried	35
querian	35
principal	35
doy	35
size	35
elegir	35
japoneses	35
lady	35
soldados	35
contrato	35
afford	35
pregunte	35
explosion	35
poem	35
mios	34
manejar	34
hermoso	34
crei	34
bar	34
levanta	34
lei	34
empezando	34
drop	34
hobby	34
distance	34
caused	34
themselves	34
straight	34
italia	34
tomando	34
escaped	34
houses	34
enorme	34
neighbors	34
translate	34
casados	34
suicide	34
tratar	34
confianza	34
casualidad	34
diet	34
aunt	34
detuvo	34
preparando	34
piernas	34
encontraste	34
willing	34
starting	34
toco	34
excited	34
upset	34
salido	34
instead	34
escribi	34
segunda	34
mire	34
acepto	34
kinds	34
pocket	34
tendra	34
subject	34
naci	34
comenzar	34
stick	34
llegamos	34
happiness	34
fair	34
decidir	34
aparecio	34
confio	34
extremadamente	34
naranja	34
pool	34
hearing	34
llamame	34
magazine	34
fever	34
salto	34
sleepy	34
gratis	34
math	34
llevara	34
cruzar	33
aquellos	33
fail	33
informe	33
acted	33
delante	33
temperatura	33
denied	33
cuello	33
license	33
extra	33
entrada	33
empleados	33
nose	33
lagrimas	33
fondo	33
lenguas	33
motivo	33
form	33
toilet	33
chess	33
lloro	33
hola	33
adentro	33
stairs	33
certainly	33
rumor	33
games	33
vacia	33
huevo	33
articulo	33
estrellas	33
jumped	33
cerro	33
llamas	33
empresa	33
fuji	33
relax	33
recientemente	33
result	33
fria	33
muebles	33
preguntar	33
speaker	33
sold	33
monte	33
pego	33
forced	33
convencer	33
temperature	33
fiebre	33
entero	33
oscuridad	33
arena	33
protect	33
bonito	33
quince	33
hechos	33
climb	33
singer	33
intentarlo	33
robado	33
calma	33
sweet	33
invitados	33
importaria	33
results	33
costumbre	32
respondio	32
sabido	32
someday	32
envio	32
pistola	32
pelea	32
paga	32
pity	32
mediodia	32
saberlo	32
wood	32
profesores	32
prize	32
pollo	32
turno	32
hacemos	32
egg	32
teatro	32
cheap	32
barely	32
oranges	32
subio	32
quedan	32
motor	32
ausente	32
handsome	32
corre	32
talento	32
decidi	32
pedirle	32
lay	32
guste	32
patience	32
vivio	32
famosa	32
add	32
particular	32
esquina	32
llevas	32
carretera	32
due	32
robaron	32
vine	32
_num_th	32
tendras	32
skirt	32
flor	32
mirar	32
dieron	32
terremoto	32
excelente	32
permitir	32
comportamiento	32
excellent	32
posibilidad	32
named	32
conocer	32
suyo	32
memory	32
esperamos	32
countries	32
sore	32
linda	32
fingers	32
according	32
anyway	32
pleased	32
act	32
trate	31
hablado	31
hacerse	31
pasamos	31
orden	31
pieces	31
suenos	31
land	31
aleman	31
asesinato	31
durmio	31
estomago	31
canciones	31
absolutamente	31
rose	31
stars	31
proposal	31
correos	31
sang	31
snowing	31
cartera	31
cometido	31
entire	31
accustomed	31
admitted	31
anillo	31
grave	31
viejos	31
earthquake	31
responsible	31
italy	31
extrana	31
casada	31
reir	31
attacked	31
echar	31
solas	31
enseguida	31
aprendiendo	31
meant	31
unlikely	31
rude	31
climbed	31
lazy	31
trajo	31
prevented	31
bathroom	31
celoso	31
trusted	31
allergic	31
habias	31
ourselves	31
weird	31
slow	31
doble	31
songs	31
ausencia	31
opportunity	31
toalla	31
plata	31
theory	31
tarjeta	31
taste	31
agreement	31
enemigos	31
dulce	31
buying	31
ciego	30
encantan	30
malas	30
prepare	30
vengas	30
hated	30
puse	30
maestro	30
account	30
revista	30
bote	30
spanish	30
invito	30
dieta	30
jump	30
distinguir	30
supermercado	30
hagan	30
urgent	30
south	30
seriously	30
hacerme	30
africa	30
andando	30
unless	30
loud	30
traveled	30
record	30
llegaste	30
resultado	30
americans	30
begins	30
doll	30
answers	30
rica	30
volar	30
invento	30
understands	30
fresco	30
letters	30
helps	30
facilmente	30
exercise	30
hung	30
empezado	30
dispuesto	30
idiot	30
presente	30
naked	30
pon	30
friday	30
vemos	30
libertad	30
altos	30
dry	30
metro	30
c	30
drogas	30
mismos	30
corner	30
attended	29
ganado	29
llamaste	29
complicated	29
hablamos	29
gives	29
ayudame	29
llovio	29
piscina	29
teachers	29
jazz	29
sons	29
worn	29
forest	29
bet	29
manager	29
cumplir	29
deber	29
cousin	29
pagina	29
llueva	29
iremos	29
neighborhood	29
poema	29
pantalones	29
paying	29
aprendido	29
dejare	29
entendido	29
estuviste	29
blew	29
vende	29
leyo	29
mentiroso	29
enfermera	29
autos	29
contact	29
recibio	29
detesto	29
wherever	29
solved	29
star	29
drove	29
cuanta	29
rope	29
sed	29
preocupa	29
fotografia	29
prohibido	29
destino	29
p	29
vecinos	29
aquello	29
partir	29
losing	29
match	29
contestar	29
recibido	29
flying	29
visa	29
arrest	29
diferentes	29
deportes	29
quedado	29
examination	29
meaning	29
papas	29
u	29
estrella	29
abandonar	29
castle	29
deserve	29
runs	29
article	29
cd	29
debi	29
managed	29
cover	29
traves	29
recibir	29
jugador	29
metio	29
gordo	29
twelve	29
fifteen	29
england	29
push	29
lasted	29
salary	29
orange	29
deeply	29
armas	29
sistema	28
debio	28
ocultar	28
matters	28
mayores	28
comienzo	28
suspect	28
lastima	28
ones	28
canta	28
director	28
calcetines	28
changes	28
supper	28
naive	28
importar	28
neck	28
tocando	28
exist	28
trago	28
debia	28
farm	28
felicidad	28
televisor	28
intentado	28
sushi	28
passengers	28
chino	28
plenty	28
escalera	28
huge	28
espacio	28
;	28
mess	28
grass	28
sali	28
ignored	28
preguntarle	28
smiling	28
hurts	28
orgullosa	28
corte	28
levantarme	28
responsable	28
respuestas	28
tongue	28
convencio	28
holiday	28
art	28
rid	28
remind	28
novelas	28
irnos	28
treated	28
apologized	28
alice	28
studies	28
barato	28
vender	28
hole	28
termine	28
pull	28
brave	28
regresar	28
thirsty	28
refuse	28
silent	28
classes	28
remained	28
cantando	28
members	28
gritar	28
claramente	28
cuadro	28
eleccion	28
plato	28
teniamos	28
pedido	28
system	28
mantuvo	28
disease	27
habido	27
above	27
billete	27
falling	27
visite	27
nuevamente	27
apart	27
hablante	27
weak	27
demasiada	27
complete	27
equivocada	27
desafortunadamente	27
avergonzado	27
listos	27
cute	27
possibility	27
querer	27
ponga	27
llegaron	27
survived	27
cinturon	27
necesitar	27
credit	27
perhaps	27
ours	27
piel	27
discovered	27
documento	27
millones	27
impidio	27
space	27
mundial	27
vistazo	27
salga	27
computadora	27
vives	27
trozo	27
prove	27
email	27
muneca	27
intend	27
army	27
spends	27
copy	27
conductor	27
regalos	27
horses	27
delicioso	27
habit	27
within	27
dormitorio	27
graduated	27
round	27
wild	27
cometer	27
using	27
appointment	27
honor	27
hopes	27
subway	27
quedaron	27
entera	27
prestar	27
market	27
cabello	27
permission	27
hogar	27
llovera	27
miembros	27
trece	27
politica	27
baloncesto	27
fallen	27
starts	27
tanta	27
mirada	27
votar	27
llamarme	27
cross	26
asustado	26
writer	26
ocurrido	26
center	26
bebida	26
admitio	26
repaired	26
million	26
kyoto	26
espanol	26
closet	26
ayudarnos	26
difficulty	26
meal	26
saliendo	26
obra	26
preparar	26
termina	26
vernos	26
copia	26
credito	26
seguros	26
sospechoso	26
cincuenta	26
inutil	26
elevator	26
ensena	26
sepas	26
comodo	26
promesas	26
gotten	26
definitely	26
agarro	26
conocio	26
tickets	26
dumb	26
hombro	26
clever	26
nadando	26
writes	26
volvi	26
preferido	26
ascensor	26
ensenar	26
ears	26
amigas	26
poca	26
alcanzar	26
romper	26
band	26
molesta	26
belong	26
hill	26
ninas	26
bite	26
laptop	26
descubrio	26
castillo	26
towel	26
illness	26
suggested	26
pequenos	26
resultados	26
introduce	26
joking	26
guapo	26
goal	26
breathe	26
ibas	26
completo	26
bomba	26
perfectly	26
detalles	26
conocemos	26
kidding	26
dando	26
esfuerzo	26
useless	26
pasatiempo	26
podido	26
alumnos	26
conduce	26
habian	26
neighbor	26
enemies	26
pudimos	26
request	26
hubiese	26
woods	26
ordeno	26
saludable	26
escondiendo	26
schedule	26
naranjas	26
guests	26
childhood	26
condition	25
haberle	25
fifty	25
ayudarle	25
pareja	25
trabajadores	25
dale	25
busco	25
remedio	25
tratado	25
poniendo	25
capitan	25
iguales	25
equipaje	25
puzzle	25
bebiendo	25
suggest	25
stranger	25
usando	25
belleza	25
example	25
sundays	25
skiing	25
largest	25
factory	25
servicio	25
valiente	25
foolish	25
cubierta	25
costs	25
ghosts	25
airplane	25
amazing	25
education	25
computers	25
paquete	25
campana	25
pants	25
deseando	25
walks	25
armario	25
risk	25
vienen	25
despedido	25
contado	25
eleven	25
engine	25
intention	25
following	25
loca	25
bienvenido	25
knocked	25
teoria	25
goodbye	25
alguno	25
rehuso	25
third	25
caer	25
accidents	25
violencia	25
accidentes	25
apago	25
odian	25
stomach	25
stronger	25
highly	25
artista	25
tareas	25
relacion	25
reminds	25
shoot	25
zoologico	25
totally	25
suya	25
traer	25
mantequilla	25
page	25
perfectamente	25
ingenuo	25
caballero	25
estupida	25
pretend	25
limpia	25
fortuna	25
stamps	25
remain	25
describe	25
quedamos	25
stone	25
ignore	25
shelf	25
warn	25
pensado	25
preguntale	25
sobras	25
miel	25
argue	25
convencido	25
diria	25
seco	25
effort	25
bomb	25
climate	25
amount	25
supone	25
tentacion	25
abilities	25
depressed	25
pidiendo	25
press	25
extranjeros	25
beauty	25
llevan	25
desperte	25
cuidadoso	25
field	24
ipad	24
citizen	24
polite	24
confia	24
granja	24
ear	24
definitivamente	24
letra	24
montar	24
warned	24
rosa	24
timido	24
automovil	24
supo	24
ocurre	24
emergency	24
harm	24
enamorada	24
apuesto	24
norte	24
toques	24
baile	24
obviously	24
apaga	24
departamento	24
texto	24
interest	24
ditch	24
drug	24
pinto	24
importancia	24
appeared	24
improbable	24
amistad	24
velocidad	24
vendre	24
fuerza	24
prometo	24
volviendo	24
washington	24
preocupada	24
awful	24
brasil	24
abierto	24
eramos	24
population	24
sonido	24
ejemplo	24
tight	24
pusieron	24
tendremos	24
ultimos	24
jail	24
maravilloso	24
desaparecio	24
carried	24
riesgo	24
mantente	24
cometio	24
banda	24
viva	24
names	24
obey	24
couch	24
candy	24
consigo	24
podriamos	24
volumen	24
querido	24
friendship	24
genial	24
easier	24
season	24
main	24
chose	24
atrapado	24
website	24
flashlight	24
estuvieron	24
complain	24
friendly	24
fingio	24
borrowed	24
dentista	24
larger	24
stories	24
planeo	24
abandon	24
moda	24
sandwiches	24
betrayed	24
fantasmas	24
fuma	24
haremos	24
becoming	24
ugly	24
veras	24
bebo	24
violence	24
captain	24
quieto	24
generally	24
profundo	24
probar	24
wise	24
religion	24
laid	24
huyo	24
impresion	24
espejo	24
heroe	24
crash	24
quedes	24
cierta	24
tough	24
asistir	24
significado	24
podamos	24
mention	24
unhappy	23
harias	23
sueter	23
pelear	23
sonreir	23
curiosidad	23
planted	23
buses	23
germany	23
molesto	23
tantos	23
tuvieron	23
complained	23
punished	23
offered	23
gentleman	23
sur	23
promises	23
cantidad	23
salvar	23
invented	23
condiciones	23
repeat	23
esfuerzos	23
energy	23
stealing	23
descubrir	23
rechazo	23
depends	23
vayan	23
estupendo	23
teaches	23
debil	23
esquiar	23
asumi	23
visita	23
percent	23
bordo	23
gerente	23
cortar	23
shock	23
cleaning	23
aparte	23
curious	23
permite	23
venta	23
succeeded	23
lies	23
mentir	23
basketball	23
discussion	23
bright	23
encontraras	23
hecha	23
garage	23
ground	23
rota	23
hablemos	23
alarma	23
uncomfortable	23
puppy	23
shoulder	23
dura	23
iria	23
agotado	23
everywhere	23
escalar	23
hubieras	23
mochila	23
lift	23
cooked	23
fool	23
montanas	23
veamos	23
nuevas	23
hello	23
diste	23
sencillamente	23
aspecto	23
badly	23
trabaje	23
mintio	23
venden	23
existen	23
conversation	23
cuestion	23
toque	23
efectivo	23
nevar	23
coma	23
acusado	23
aprecio	23
apagar	23
bucket	23
available	23
mathematics	23
tallest	23
evil	23
solar	23
sonando	23
frightened	23
value	23
traeme	23
elected	23
escritor	23
pasas	23
colina	23
photo	23
bench	23
cuida	23
fracaso	23
skin	23
anciana	22
unable	22
caballos	22
cambia	22
vivimos	22
entra	22
nearest	22
capaces	22
valla	22
musico	22
pesca	22
thanked	22
lentamente	22
brazos	22
gane	22
holidays	22
enfadada	22
inglaterra	22
translated	22
agujero	22
dying	22
suppose	22
costara	22
grateful	22
tendria	22
roma	22
ponerse	22
vacio	22
traveling	22
jam	22
cocinero	22
levantarse	22
objetivo	22
material	22
musical	22
robbed	22
member	22
adios	22
engano	22
golpe	22
committed	22
local	22
escena	22
appears	22
arguing	22
hoping	22
notas	22
pongo	22
draw	22
alergico	22
tomara	22
juegos	22
toy	22
practice	22
despertar	22
reach	22
discussed	22
alcalde	22
ex	22
patatas	22
estadounidenses	22
san	22
mudo	22
ruined	22
historias	22
nuts	22
pulled	22
science	22
picasso	22
nubes	22
productos	22
muchacha	22
boleto	22
electricidad	22
estadounidense	22
hi	22
civil	22
sueldo	22
matrimonio	22
necesidad	22
musician	22
suspicious	22
issue	22
although	22
compared	22
empece	22
criminal	22
social	22
trabajado	22
fridge	22
agradecido	22
asesino	22
sand	22
talent	22
scream	22
recognized	22
apartamento	22
mirror	22
asuntos	22
dormi	22
invitacion	22
talented	22
comienza	22
recommend	22
lack	22
winning	22
seguida	22
closer	22
interrupt	22
doctors	22
parecio	22
embarrassing	22
survive	22
energia	22
divorced	22
impressed	21
sharp	21
logro	21
maravillosa	21
invitado	21
cajon	21
esperemos	21
cercano	21
suicido	21
embarrassed	21
francesa	21
autor	21
receive	21
convirtio	21
dreamed	21
kissing	21
pressure	21
soltero	21
preocuparse	21
soldier	21
greatest	21
removed	21
thirteen	21
crossed	21
details	21
cambie	21
coches	21
programa	21
scolded	21
viajo	21
wins	21
sort	21
nombres	21
hokkaido	21
lincoln	21
cerdo	21
visito	21
dedico	21
jugamos	21
gustado	21
razonable	21
complicado	21
document	21
ocurrir	21
rome	21
presentes	21
grown	21
cientifico	21
steal	21
smaller	21
requiere	21
comunmente	21
canceled	21
muertos	21
deme	21
disculpas	21
artist	21
desea	21
soldado	21
seguido	21
sleeps	21
iron	21
genio	21
regla	21
importantes	21
vinieron	21
collar	21
vecino	21
orders	21
staring	21
impaciente	21
build	21
note	21
entiendes	21
pasajeros	21
sere	21
bebio	21
saltar	21
esten	21
pongas	21
lesson	21
metal	21
frigorifico	21
coge	21
habito	21
canadienses	21
ridiculo	21
vendria	21
louder	21
newspapers	21
sensible	21
successful	21
spread	21
fought	21
author	21
cae	21
gustara	21
doubts	21
lindo	21
conferencia	21
drunken	21
changing	21
growing	21
sport	21
miembro	21
workers	21
leftovers	21
cercana	21
pagado	21
asumo	21
conversacion	21
ayudado	20
trabajas	20
largas	20
stared	20
suponia	20
malos	20
quejas	20
verle	20
pague	20
knowing	20
escuchado	20
dificultad	20
jobs	20
hablaba	20
cansados	20
bajar	20
escenario	20
desperto	20
cuentame	20
locos	20
electricity	20
signed	20
album	20
decia	20
gained	20
kindness	20
battle	20
baffled	20
sugirio	20
materna	20
thin	20
decepcionado	20
angel	20
ambas	20
yendo	20
conduciendo	20
tied	20
recognize	20
apetece	20
embargo	20
supe	20
disappeared	20
exhausted	20
fuertes	20
actress	20
contract	20
torre	20
reasonable	20
seats	20
directo	20
canadians	20
abandonado	20
ciento	20
cerrados	20
emergencia	20
aprobo	20
itself	20
decisions	20
saque	20
estudie	20
bello	20
tiempos	20
buried	20
salario	20
altura	20
actual	20
relationship	20
version	20
drives	20
repair	20
politico	20
clouds	20
viniste	20
pasto	20
robar	20
postre	20
cafeteria	20
comete	20
treat	20
falda	20
pale	20
shorter	20
fe	20
deserted	20
election	20
aprendiste	20
millas	20
ensalada	20
direction	20
otono	20
interes	20
capable	20
debt	20
temptation	20
advantage	20
chiste	20
formas	20
poems	20
sano	20
impuestos	20
quedando	20
calvo	20
herida	20
movil	20
anger	20
botas	20
planea	20
curso	20
salad	20
basket	20
piensan	20
master	20
estarias	20
finding	20
asesinado	20
sabian	20
bald	20
lately	20
estuvimos	20
ofrecio	20
saliera	20
password	20
saving	20
encontraron	20
esperado	20
consejos	20
touched	20
lower	20
facts	20
quick	20
model	20
rodilla	20
alfombra	20
ensename	19
primos	19
raton	19
birth	19
extranos	19
continuar	19
visiting	19
facebook	19
persuade	19
safety	19
verguenza	19
north	19
acerco	19
estaremos	19
fueras	19
empezamos	19
apparently	19
juez	19
llegues	19
acuso	19
pare	19
linterna	19
sean	19
expert	19
razones	19
escriba	19
incapaz	19
escuchaste	19
nature	19
spilled	19
politics	19
teme	19
cares	19
callado	19
ahorrar	19
vengo	19
ciencia	19
puntual	19
ocean	19
afortunado	19
acuerdas	19
voted	19
cigarette	19
agradezco	19
vago	19
fallo	19
jugaba	19
supuesto	19
salieron	19
solicitud	19
sencillo	19
plantas	19
poblacion	19
extranjera	19
baked	19
brown	19
insisted	19
deberiais	19
throat	19
calidad	19
rights	19
evidence	19
trapped	19
obvious	19
hero	19
oiste	19
ink	19
presents	19
dreaming	19
ambulancia	19
fijamente	19
brazil	19
anxious	19
imagen	19
cerrado	19
manten	19
hidden	19
vieron	19
nivel	19
nevando	19
sells	19
teniendo	19
nonsense	19
antigua	19
reply	19
stops	19
generalmente	19
economy	19
tomate	19
querrias	19
fisica	19
comprarme	19
excusa	19
cheek	19
outfit	19
cabra	19
polvo	19
luce	19
cigarettes	19
aprende	19
ejercito	19
amarilla	19
acting	19
properly	19
empezaron	19
lapices	19
illegal	19
vuelvo	19
pido	19
tengamos	19
iban	19
bush	19
preparo	19
trap	19
handle	19
sente	19
sensitive	19
sales	19
tranquilo	19
necesites	19
admire	19
rieron	19
destroyed	19
ringing	19
punta	19
pond	19
acabas	19
noisy	19
notebook	19
estudias	19
muestrame	19
llegaria	19
bottom	19
cima	19
rojas	19
dudas	19
aboard	19
claimed	19
haras	19
encendio	19
pasear	19
llegaras	19
atrasado	19
alemania	19
patio	19
fortune	19
alimentar	19
licencia	18
adoro	18
desierto	18
suave	18
elegido	18
heavily	18
sirve	18
inteligentes	18
hall	18
hire	18
llamaba	18
enjoying	18
humano	18
formulario	18
asia	18
planeta	18
flag	18
hoja	18
abra	18
quality	18
amabilidad	18
escapo	18
arms	18
existe	18
llamando	18
bebido	18
reparar	18
cuento	18
oirte	18
querais	18
falso	18
parecer	18
incomodo	18
acceso	18
leo	18
cocinando	18
smarter	18
hug	18
volando	18
tamano	18
placer	18
actuar	18
action	18
ambulance	18
cab	18
abri	18
levantado	18
inocencia	18
piloto	18
imagino	18
confundido	18
digan	18
poker	18
murdered	18
parked	18
prefieres	18
grabbed	18
junio	18
text	18
esperare	18
atentamente	18
nota	18
obedecer	18
enfadar	18
vase	18
ensenarme	18
admitir	18
comprender	18
tomaron	18
blackboard	18
trains	18
contrario	18
ridiculous	18
hired	18
june	18
digame	18
ponerte	18
ocurra	18
mover	18
remembered	18
toward	18
sentarme	18
detail	18
stove	18
naturaleza	18
decisiones	18
confidence	18
opciones	18
chat	18
sordo	18
ataque	18
lea	18
express	18
conversar	18
trabajaba	18
causo	18
pepper	18
herir	18
genius	18
sabor	18
aseguro	18
mercado	18
pushed	18
companero	18
shake	18
enfado	18
soporto	18
bandera	18
enviar	18
cell	18
clientes	18
mejorar	18
pienses	18
sientate	18
cesped	18
dessert	18
diamond	18
tantas	18
spite	18
raincoat	18
horario	18
podras	18
mires	18
rosas	18
fila	18
boots	18
dentist	18
advance	18
levantar	18
ocultando	18
loss	18
apariencia	18
roses	18
importance	18
earns	18
gracioso	18
gira	18
private	18
dollar	18
checked	18
necesite	18
personally	18
grosero	18
corri	18
ponerme	18
watches	18
stubborn	18
kicked	18
contrasena	18
respirar	18
izquierdo	18
renunciar	18
aumento	18
peeling	18
cheated	18
aproximadamente	18
comprendo	18
trabajamos	18
occurred	18
oxigeno	18
busque	18
humanos	18
imaginar	18
board	18
hierro	18
primo	18
introduced	18
bienvenida	18
esconder	18
parecido	17
creen	17
conocimos	17
despierta	17
comprarle	17
cuentas	17
lugares	17
paginas	17
fbi	17
funcionar	17
bailando	17
electronico	17
dating	17
progress	17
sueles	17
snakes	17
cottage	17
shoe	17
reputacion	17
comoda	17
conference	17
martes	17
medicamento	17
british	17
besar	17
senor	17
grapes	17
sour	17
ibamos	17
personalmente	17
medida	17
llegas	17
alimentos	17
compra	17
divertida	17
salida	17
shed	17
colores	17
attractive	17
shared	17
haberse	17
muro	17
lawn	17
reads	17
mistaken	17
considero	17
vea	17
dificiles	17
guardar	17
mt	17
portugal	17
sunny	17
ayudaria	17
llevarse	17
divorcio	17
incident	17
viniera	17
flew	17
arrepiento	17
culpar	17
forty	17
marriage	17
insane	17
trataba	17
sudden	17
bromas	17
method	17
creyo	17
panuelo	17
danos	17
refrigerador	17
program	17
sentados	17
mostrarme	17
abrazo	17
santa	17
ordenes	17
begged	17
oceano	17
regrese	17
companeros	17
gustas	17
trabajan	17
cierre	17
tail	17
deprimido	17
breve	17
bowed	17
region	17
oldest	17
detalle	17
dejalo	17
capacidades	17
zumo	17
chistes	17
economia	17
examenes	17
cleaned	17
meta	17
riendo	17
planeando	17
azules	17
propias	17
options	17
cuarenta	17
dijera	17
compartir	17
sigues	17
charla	17
sentenced	17
accion	17
kilometers	17
aula	17
gate	17
batalla	17
hawaii	17
desert	17
raw	17
posee	17
pregnant	17
pack	17
fairly	17
secundaria	17
pillo	17
enojada	17
typhoon	17
reuniones	17
dificultades	17
compare	17
arrestado	17
increible	17
burning	17
seras	17
arriving	17
banged	17
faith	17
jeans	17
sociedad	17
proteger	17
muchachos	17
equal	17
llevarme	17
mostrarte	17
verla	17
concerned	17
voluntario	17
double	17
exciting	17
asientos	17
hacerle	17
service	17
diary	17
forgetful	17
habilidades	17
colgo	17
posicion	17
mystery	17
divided	17
basta	17
abril	17
latin	17
podias	17
cubierto	17
tire	17
salgas	17
leon	17
mostrare	17
prohibited	17
lento	17
peleando	17
presion	17
tells	17
consegui	17
privado	17
novels	17
tap	17
sucede	17
ciudadano	17
major	17
olvida	17
cousins	17
coser	17
mentido	17
llevare	17
committee	16
colectivo	16
comimos	16
invitation	16
instituto	16
soap	16
